# Remove data from Data Frames
- axis = 1 -> will remove columns
- axis = 0 -> will remove rowss

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({
    "Product": ["Laptop","Mouse","Keyboard","Monitor","HeadtSet"],
    "UnitSold": [12,50,34,20,40],
    "Price": [120000,1300,1500,25000,6000],
    "Discount":[0.10,0.05,0.00,0.12,0.07]
})

In [4]:
df

    Product  UnitSold   Price  Discount
0    Laptop        12  120000      0.10
1     Mouse        50    1300      0.05
2  Keyboard        34    1500      0.00
3   Monitor        20   25000      0.12
4  HeadtSet        40    6000      0.07

In [5]:
df.drop('Discount',axis=1)

    Product  UnitSold   Price
0    Laptop        12  120000
1     Mouse        50    1300
2  Keyboard        34    1500
3   Monitor        20   25000
4  HeadtSet        40    6000

In [8]:
df.drop(3,axis=0)

    Product  UnitSold   Price  Discount
0    Laptop        12  120000      0.10
1     Mouse        50    1300      0.05
2  Keyboard        34    1500      0.00
4  HeadtSet        40    6000      0.07

In [11]:
df =pd.read_csv("../Assets/person_data - person_data.csv")
print(df)
print(type(df))

   Name  Age    Country      City
0  Alex   16  Sri Lanka   Colombo
1   Mia   17  Australia    Sydney
2  Ravi   15        USA  New York
3  Sara   16         UK    London
4  Liam   17     Canada   Toronto
<class 'pandas.core.frame.DataFrame'>

In [ ]:
df_json = pd.read_json("")

In [12]:
df.head()

   Name  Age    Country      City
0  Alex   16  Sri Lanka   Colombo
1   Mia   17  Australia    Sydney
2  Ravi   15        USA  New York
3  Sara   16         UK    London
4  Liam   17     Canada   Toronto